English/read aloud.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
#+begin_verse
Sentences vs. Propositions
 
We have already noticed another thing about the rules we are going to discuss in this chapter. As in the case of the rule about words and terms, we are here also dealing with the relation of language and thought. Sentences and paragraphs are grammatical units. They are units of language. Propositions and arguments are logical units, or units of thought and knowledge.

We have to face here a problem similar to the one we faced in the last chapter. Because language is not a perfect medium for the expression of thought, because one word can have many meanings and two or more words can have the same meaning, we saw how complicated was the relation between an author’s vocabulary and his terminology. One word may represent several terms, and one term may be represented by several words.

Mathematicians describe the relation between the buttons and the buttonholes on a well-made coat as a one-to-one relationship. There is a button for every buttonhole, and a hole for every button. Well, the point is that words and terms do not stand in a one-to-one relation. The greatest error you can make in applying these rules is to suppose that a one-to-one relationship exists between the elements of language and those of thought or knowledge.

As a matter of fact, it would be wise not to make too easy assumptions even about buttons and buttonholes. The sleeves of most men’s suit jackets bear buttons that have no corresponding buttonholes. And if you have worn the coat for a while, it may have a hole with no corresponding button.

Let us illustrate this in the case of sentences and propositions. Not every sentence in a book expresses a proposition. For one thing, some sentences express questions. They state problems rather than answers. Propositions are the answers to questions. They are declarations of knowledge or opinion. That is why we call sentences that express them declarative, and distinguish sentences that ask questions as interrogative. Other sentences express wishes or intentions. They may give us some knowledge of the author’s purpose, but they do not convey the knowledge he is trying to expound.

Moreover, not all the declarative sentences can be read as if each expressed one proposition. There are at least two reasons for this. The first is the fact that words are ambiguous and can be used in various sentences. Thus, it is possible for the same sentence to express different propositions if there is a shift in the terms the words express. “Reading is learning” is a simple sentence; but if at one place we mean by “learning” the acquisition of information, and at another we mean the development of understanding, the proposition is not the same, because the terms are different. Yet the sentence is the same.

The second reason is that all sentences are not as simple as “Reading is learning.” When its words are used unambiguously, a simple sentence usually expresses a single proposition. But even when its words are used unambiguously, a compound sentence expresses two or more propositions. A compound sentence is really a collection of sentences, connected by such words as “and,” or “if … then,” or “not only … but also.” You may rightly conclude that the line between a long compound sentence and a short paragraph may be difficult to draw. A compound sentence can express a number of propositions related in the form of an argument.

Such sentences can be very difficult to interpret. Let us take an interesting sentence from Machiavelli’s The Prince to show what we mean:

A prince ought to inspire fear in such a way that, if he does not win love, he avoids hatred; because he can endure very well being feared whilst he is not hated, which will always be as long as he abstains from the property of his citizens and from their women.

This is grammatically a single sentence, though it is extremely complex. The semicolon and the “because” indicate the major break in it. The first proposition is that a prince ought to inspire fear in a certain way.

Beginning with the word “because,” we have what is in effect another sentence. (It could be made independent by saying: “The reason for this is that he can endure,” and so forth.) And this sentence expresses two propositions at least: (1) the reason why the prince ought to inspire fear in a certain way is that he can endure being feared so long as he is not hated; (2) he can avoid being hated only by keeping his hands off the property of his citizens and their women.

It is important to distinguish the various propositions that a long, complex sentence contains. In order to agree or disagree with Machiavelli, you must first understand what he is saying. But he is saying three things in this one sentence. You may disagree with one of them and agree with the others. You may think Machiavelli is wrong in recommending terrorism to a prince on any grounds; but you may acknowledge his shrewdness in saying that the prince had better not arouse hatred along with fear, and you may also agree that keeping his hands off his subjects’ property and women is an indispensable condition of not being hated. Unless you recognize the distinct propositions in a complicated sentence, you cannot make a discriminating judgment on what the writer is saying.

Lawyers know this fact very well. They have to examine sentences carefully to see what is being alleged by the plaintiff or denied by the defendant. The single sentence, “John Doe signed the lease on March 24,” looks simple enough, but still it says several things, some of which may be true and the others false. John Doe may have signed the lease, but not on March 24, and that fact may be important. In short, even a grammatically simple sentence sometimes expresses two or more propositions.

We have said enough to indicate what we mean by the difference between sentences and propositions. They are not related as one to one. Not only can a single sentence express several propositions, either through ambiguity or complexity, but one and the same proposition can also be expressed by two or more different sentences. If you grasp our terms through the words and phrases we use synonymously, you will know that we are saying the same thing when we say, “Teaching and being taught are correlative functions,” and “Initiating and receiving communication are related processes.”

We are going to stop explaining the grammatical and logical points involved and turn to the rules. The difficulty in this chapter, as in the last, is to stop explaining. Instead, we will assume that you know some grammar. We do not necessarily mean that you must understand everything about syntax, but you should be concerned about the ordering of words in sentences and their relation to one another. Some knowledge of grammar is indispensable to a reader. You cannot begin to deal with terms, propositions, and arguments—the elements of thought—until you can penetrate beneath the surface of language. So long as words, sentences, and paragraphs are opaque and unanalyzed, they are a barrier to, rather than a medium of, communication. You will read words but not receive knowledge.

Here are the rules. The fifth rule of reading, as you will recall from the last chapter, was: RULE 5. FIND THE IMPORTANT WORDS AND COME TO TERMS. The sixth rule can be expressed thus: RULE 6. MARK THE MOST IMPORTANT SENTENCES IN A BOOK AND DISCOVER THE PROPOSITIONS THEY CONTAIN. The seventh rule is this: RULE 7. LOCATE OR CONSTRUCT THE BASIC ARGUMENTS IN THE BOOK BY FINDING THEM IN THE CONNECTION OF SENTENCES. You will see later why we did not say “paragraphs” in the formulation of this rule.

Incidentally, it is just as true of these new rules as it was of the rule about coming to terms that they apply primarily to expository works. The rules about propositions and arguments are quite different when you are reading a poetical work—a novel, play, or poem. We will discuss the changes that are required in applying them to such works later.









#+end_verse
